# ExportCategory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..ExportCategory Property
EnergyDataSettings Class See Also
---
Value is a category indicating which discipline model will be used for GreenBuildingXML export.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId ExportCategory { get; set; }
```

Visual Basic
---
```text
Public Property ExportCategory As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ExportCategory {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
OST_Rooms will use the architectural 3d rooms for export. OST_MEPSpaces will use the MEP 3d Spaces for export.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The export category is neither OST_Rooms nor OST_MEPSpaces. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace